## Import libraries

In [155]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd# Importing the dataset
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB

## main steps

In [156]:
data = [
    ['James','20','Germany','M','Rock'],
    ['Tony','22','Germany','M','Rock'],
    ['Mason','30','UK','M','Jazz'],
    ['Mary','30','Germany','F','Rock'],
    ['Scarlett','26','UK','F','Jazz'],
    ['Ken','18','Spain','M','Pop'],
    ['Lily','30','UK','F','Jazz'],
    ['Audre','16','UK','F','Pop'],
    ['Hazel','18','Spain','F','Pop'],
    ['Evelyn','18','Spain','M','Pop']
]
data_columns = ['name','age','country','gender','music']
test_columns = ['age','country','gender']
df = pd.DataFrame(data, columns = data_columns)

In [157]:
df

       name age  country gender music
0     James  20  Germany      M  Rock
1      Tony  22  Germany      M  Rock
2     Mason  30       UK      M  Jazz
3      Mary  30  Germany      F  Rock
4  Scarlett  26       UK      F  Jazz
5       Ken  18    Spain      M   Pop
6      Lily  30       UK      F  Jazz
7     Audre  16       UK      F   Pop
8     Hazel  18    Spain      F   Pop
9    Evelyn  18    Spain      M   Pop

In [158]:
# label encoding

country_en = LabelEncoder()
df['country'] = country_en.fit_transform(df['country'])
music_en = LabelEncoder()
df['music'] = music_en.fit_transform(df['music'])
gender_en = LabelEncoder()
df['gender'] = gender_en.fit_transform(df['gender'])

In [159]:
# input and target
X = df.iloc[:, [1,2,3]].values
y = df.iloc[:, 4].values

In [160]:
df

       name age  country  gender  music
0     James  20        0       1      2
1      Tony  22        0       1      2
2     Mason  30        2       1      0
3      Mary  30        0       0      2
4  Scarlett  26        2       0      0
5       Ken  18        1       1      1
6      Lily  30        2       0      0
7     Audre  16        2       0      1
8     Hazel  18        1       0      1
9    Evelyn  18        1       1      1

In [161]:
# Splitting the dataset into the Training set and Test set
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 0)

In [166]:
# test data
test_data = [['Jane','22','Spain','F']]
test_df = pd.DataFrame(test_data, columns = ['name','age','country','gender'])

In [167]:
# encoding for test data
test_df['country'] = country_en.transform(test_df['country'])
test_df['gender'] = gender_en.transform(test_df['gender'])
test_df

   name age  country  gender
0  Jane  22        1       0

In [168]:
test_df

   name age  country  gender
0  Jane  22        1       0

In [169]:
##KNN Classifier

# Fitting classifier to the Training set
classifier = KNeighborsClassifier(n_neighbors = 3)
classifier.fit(X_train, y_train)

KNeighborsClassifier(n_neighbors=3)

In [170]:
# Predicting the Test set results
y_pred = classifier.predict(test_df[test_columns])

In [171]:
y_pred_lb = music_en.inverse_transform(y_pred)

In [172]:
print("Predicted result is ", y_pred_lb[0])

Predicted result is  Rock

In [173]:
# For jane the prediction for music genre is of encoded 1 which is genre Rock
## Jane would love some Rock music.

In [174]:
##NAIVE_BAYES classifier
classifier = GaussianNB()
classifier.fit(X_train, y_train)

GaussianNB()

In [175]:
y_pred  =  classifier.predict(test_df[test_columns])

In [176]:
y_pred_lb = music_en.inverse_transform(y_pred)

In [177]:
print("Predicted result is ", y_pred_lb[0])

Predicted result is  Pop

In [178]:
## Again  , via the naive bayes classifier , we get our prediction for catagorical 1 for music genre , which is Rock
# jane would love Rock music According to naive-bayes